# 1.网络请求
# www.baidu.com     --url 统一资源定位符

# 请求过程：
# 客户端，指的是web浏览器，向服务器发送请求

# 请求：分为4部分：
# 1.请求网址    -- request  url
# 2.请求方法    -- request method
# 3.请求头      -- request head
# 4.请求体      -- request body

# F12查看请求响应

# 爬虫的作用
# 1.数据采集
# 2.软件测试
# 3.抢票
# 4.网络安全
# 5.web漏洞扫描

# 3.爬虫分类
# 根据爬取网站的数量：通用爬虫，聚焦爬虫 （主要学习的）
# 根绝获取数据的目的：功能性爬虫，数据增量爬虫

# 4.爬虫的基本流程
# 1.确认目标
# 2.发送请求：发送网络请求，获取到特定的服务端给你的响应
# 3.提取数据：从响应中提取特定的数据        jsonpath/xpath/re
# 4.保存数据：本地（html,json,txt）、数据库

# 获取到的响应中，有可能会提取到还需要继续发送请求的url，可以拿着解析的url继续发送请求

# 5.robots协议
# robots协议并不是一个规范，只是约定俗称的

